QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_hrpwm.h
#ifndef HW_HRPWM_H
#define HW_HRPWM_H

//*************************************************************************************************
//
// The following are defines for the HRPWM register offsets
//
//*************************************************************************************************
#define HRPWM_O_TBCTL          0x0U   // Time Base Control Register
#define HRPWM_O_TBCTL2         0x2U   // Time Base Control Register 2
#define HREPWM_O_EPWMSYNCINSEL 0x6U   // EPWM SYNCI Select Register
#define HRPWM_O_TBCTR          0x8U   // Time Base Counter Register
#define HRPWM_O_TBSTS          0xAU   // Time Base Status Register
#define HRPWM_O_CMPCTL         0x10U  // Counter Compare Control Register
#define HRPWM_O_CMPCTL2        0x12U  // Counter Compare Control Register 2
#define HRPWM_O_DBCTL          0x18U  // Dead-Band Generator Control Register
#define HRPWM_O_DBCTL2         0x1AU  // Dead-Band Generator Control Register 2
#define HRPWM_O_AQCTL          0x20U  // Action Qualifier Control Register
#define HRPWM_O_AQTSRCSEL      0x22U  // Action Qualifier Trigger Event Source Select Register
#define HRPWM_O_PCCTL          0x28U  // PWM Chopper Control Register
#define HRPWM_O_VCAPCTL        0x30U  // Valley Capture Control Register
#define HRPWM_O_VCNTCFG        0x32U  // Valley Counter Config Register
#define HRPWM_O_HRCNFG         0x40U  // HRPWM Configuration Register
#define HRPWM_O_HRPWR          0x42U  // HRPWM Power Register
#define HRPWM_O_HRMSTEP        0x4CU  // HRPWM MEP Step Register
#define HRPWM_O_HRCNFG2        0x4EU  // HRPWM Configuration 2 Register
#define HRPWM_O_HRPCTL         0x5AU  // High Resolution Period Control Register
#define HRPWM_O_TRREM          0x5CU  // HRPWM High Resolution Remainder Register
#define HRPWM_O_GLDCTL         0x68U  // Global PWM Load Control Register
#define HRPWM_O_GLDCFG         0x6AU  // Global PWM Load Config Register
#define HRPWM_O_EPWMXLINK      0x70U  // EPWMx Link Register
#define HRPWM_O_AQCTLA         0x80U  // Action Qualifier Control Register For Output A
#define HRPWM_O_AQCTLA2        0x82U  // Additional Action Qualifier Control Register For Output A
#define HRPWM_O_AQCTLB         0x84U  // Action Qualifier Control Register For Output B
#define HRPWM_O_AQCTLB2        0x86U  // Additional Action Qualifier Control Register For Output B
#define HRPWM_O_AQSFRC         0x8EU  // Action Qualifier Software Force Register
#define HRPWM_O_AQCSFRC        0x92U  // Action Qualifier Continuous S/W Force Register
#define HRPWM_O_DBREDHR        0xA0U  // Dead-Band Generator Rising Edge Delay High Resolution
#define HRPWM_O_DBRED          0xA2U  // Dead-Band Generator Rising Edge Delay High Resolution
#define HRPWM_O_DBFEDHR        0xA4U  // Dead-Band Generator Falling Edge Delay High Resolution
#define HRPWM_O_DBFED          0xA6U  // Dead-Band Generator Falling Edge Delay Count Register
#define HRPWM_O_TBPHS          0xC0U  // Time Base Phase High
#define HRPWM_O_TBPRDHR        0xC4U  // Time Base Period High Resolution Register
#define HRPWM_O_TBPRD          0xC6U  // Time Base Period Register
#define HRPWM_O_CMPA           0xD4U  // Counter Compare A Register
#define HRPWM_O_CMPB           0xD8U  // Compare B Register
#define HRPWM_O_CMPC           0xDEU  // Counter Compare C Register
#define HRPWM_O_CMPD           0xE2U  // Counter Compare D Register
#define HRPWM_O_GLDCTL2        0xE8U  // Global PWM Load Control Register 2
#define HRPWM_O_SWVDELVAL      0xEEU  // Software Valley Mode Delay Register
#define HRPWM_O_TZSEL          0x100U // Trip Zone Select Register
#define HRPWM_O_TZDCSEL        0x104U // Trip Zone Digital Comparator Select Register
#define HRPWM_O_TZCTL          0x108U // Trip Zone Control Register
#define HRPWM_O_TZCTL2         0x10AU // Additional Trip Zone Control Register
#define HRPWM_O_TZCTLDCA       0x10CU // Trip Zone Control Register Digital Compare A
#define HRPWM_O_TZCTLDCB       0x10EU // Trip Zone Control Register Digital Compare B
#define HRPWM_O_TZEINT         0x11AU // Trip Zone Enable Interrupt Register
#define HRPWM_O_TZFLG          0x126U // Trip Zone Flag Register
#define HRPWM_O_TZCBCFLG       0x128U // Trip Zone CBC Flag Register
#define HRPWM_O_TZOSTFLG       0x12AU // Trip Zone OST Flag Register
#define HRPWM_O_TZCLR          0x12EU // Trip Zone Clear Register
#define HRPWM_O_TZCBCCLR       0x130U // Trip Zone CBC Clear Register
#define HRPWM_O_TZOSTCLR       0x132U // Trip Zone OST Clear Register
#define HRPWM_O_TZFRC          0x136U // Trip Zone Force Register
#define HRPWM_O_ETSEL          0x148U // Event Trigger Selection Register
#define HRPWM_O_ETPS           0x14CU // Event Trigger Pre-Scale Register
#define HRPWM_O_ETFLG          0x150U // Event Trigger Flag Register
#define HRPWM_O_ETCLR          0x154U // Event Trigger Clear Register
#define HRPWM_O_ETFRC          0x158U // Event Trigger Force Register
#define HRPWM_O_ETINTPS        0x15CU // Event-Trigger Interrupt Pre-Scale Register
#define HRPWM_O_ETSOCPS        0x160U // Event-Trigger SOC Pre-Scale Register
#define HRPWM_O_ETCNTINITCTL   0x164U // Event-Trigger Counter Initialization Control Register
#define HRPWM_O_ETCNTINIT      0x168U // Event-Trigger Counter Initialization Register
#define HRPWM_O_DCTRIPSEL      0x180U // Digital Compare Trip Select Register
#define HRPWM_O_DCACTL         0x186U // Digital Compare A Control Register
#define HRPWM_O_DCBCTL         0x188U // Digital Compare B Control Register
#define HRPWM_O_DCFCTL         0x18EU // Digital Compare Filter Control Register
#define HRPWM_O_DCCAPCTL       0x190U // Digital Compare Capture Control Register
#define HRPWM_O_DCFOFFSET      0x192U // Digital Compare Filter Offset Register
#define HRPWM_O_DCFOFFSETCNT   0x194U // Digital Compare Filter Offset Counter Register
#define HRPWM_O_DCFWINDOW      0x196U // Digital Compare Filter Window Register
#define HRPWM_O_DCFWINDOWCNT   0x198U // Digital Compare Filter Window Counter Register
#define HRPWM_O_DCCAP          0x19EU // Digital Compare Counter Capture Register
#define HRPWM_O_DCAHTRIPSEL    0x1A4U // Digital Compare AH Trip Select
#define HRPWM_O_DCALTRIPSEL    0x1A6U // Digital Compare AL Trip Select
#define HRPWM_O_DCBHTRIPSEL    0x1A8U // Digital Compare BH Trip Select
#define HRPWM_O_DCBLTRIPSEL    0x1AAU // Digital Compare BL Trip Select
#define HRPWM_O_EPWMLOCK       0x1F4U // EPWM Lock Register
#define HRPWM_O_HWVDELVAL      0x1FAU // Hardware Valley Mode Delay Register
#define HRPWM_O_VCNTVAL        0x1FCU // Hardware Valley Counter Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL register
//
//*************************************************************************************************
#define HRPWM_TBCTL_CTRMODE_S   0U
#define HRPWM_TBCTL_CTRMODE_M   0x3U // Counter Mode
#define HRPWM_TBCTL_PHSEN       0x4U // Phase Load Enable
#define HRPWM_TBCTL_PRDLD       0x8U // Active Period Load
#define HRPWM_TBCTL_SYNCOSEL_S  4U
#define HRPWM_TBCTL_SYNCOSEL_M  0x30U // Sync Output Select
#define HRPWM_TBCTL_SWFSYNC     0x40U // Software Force Sync Pulse
#define HRPWM_TBCTL_HSPCLKDIV_S 7U
#define HRPWM_TBCTL_HSPCLKDIV_M 0x380U // High Speed TBCLK Pre-scaler
#define HRPWM_TBCTL_CLKDIV_S    10U
#define HRPWM_TBCTL_CLKDIV_M    0x1C00U // Time Base Clock Pre-scaler
#define HRPWM_TBCTL_PHSDIR      0x2000U // Phase Direction Bit
#define HRPWM_TBCTL_FREE_SOFT_S 14U
#define HRPWM_TBCTL_FREE_SOFT_M 0xC000U // Emulation Mode Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBCTL2 register
//
//*************************************************************************************************
#define HRPWM_TBCTL2_OSHTSYNCMODE 0x40U // One shot sync mode
#define HRPWM_TBCTL2_OSHTSYNC     0x80U // One shot sync
#define HRPWM_TBCTL2_SYNCOSELX_S  12U
#define HRPWM_TBCTL2_SYNCOSELX_M  0x3000U // Syncout selection
#define HRPWM_TBCTL2_PRDLDSYNC_S  14U
#define HRPWM_TBCTL2_PRDLDSYNC_M  0xC000U // PRD Shadow to Active Load on SYNC Event

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMSYNCINSEL register
//
//*************************************************************************************************
#define HRPWM_EPWMSYNCINSEL_SEL_S 0U
#define HRPWM_EPWMSYNCINSEL_SEL_M 0x7FU // EPWM SYNCIN Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBSTS register
//
//*************************************************************************************************
#define HRPWM_TBSTS_CTRDIR 0x1U // Counter Direction Status
#define HRPWM_TBSTS_SYNCI  0x2U // External Input Sync Status
#define HRPWM_TBSTS_CTRMAX 0x4U // Counter Max Latched Status

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPCTL register
//
//*************************************************************************************************
#define HRPWM_CMPCTL_LOADAMODE_S 0U
#define HRPWM_CMPCTL_LOADAMODE_M 0x3U // Active Compare A Load
#define HRPWM_CMPCTL_LOADBMODE_S 2U
#define HRPWM_CMPCTL_LOADBMODE_M 0xCU   // Active Compare B Load
#define HRPWM_CMPCTL_SHDWAMODE   0x10U  // Compare A Register Block Operating Mode
#define HRPWM_CMPCTL_SHDWBMODE   0x40U  // Compare B Register Block Operating Mode
#define HRPWM_CMPCTL_SHDWAFULL   0x100U // Compare A Shadow Register Full Status
#define HRPWM_CMPCTL_SHDWBFULL   0x200U // Compare B Shadow Register Full Status
#define HRPWM_CMPCTL_LOADASYNC_S 10U
#define HRPWM_CMPCTL_LOADASYNC_M 0xC00U // Active Compare A Load on SYNC
#define HRPWM_CMPCTL_LOADBSYNC_S 12U
#define HRPWM_CMPCTL_LOADBSYNC_M 0x3000U // Active Compare B Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPCTL2 register
//
//*************************************************************************************************
#define HRPWM_CMPCTL2_LOADCMODE_S 0U
#define HRPWM_CMPCTL2_LOADCMODE_M 0x3U // Active Compare C Load
#define HRPWM_CMPCTL2_LOADDMODE_S 2U
#define HRPWM_CMPCTL2_LOADDMODE_M 0xCU  // Active Compare D load
#define HRPWM_CMPCTL2_SHDWCMODE   0x10U // Compare C Block Operating Mode
#define HRPWM_CMPCTL2_SHDWDMODE   0x40U // Compare D Block Operating Mode
#define HRPWM_CMPCTL2_LOADCSYNC_S 10U
#define HRPWM_CMPCTL2_LOADCSYNC_M 0xC00U // Active Compare C Load on SYNC
#define HRPWM_CMPCTL2_LOADDSYNC_S 12U
#define HRPWM_CMPCTL2_LOADDSYNC_M 0x3000U // Active Compare D Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBCTL register
//
//*************************************************************************************************
#define HRPWM_DBCTL_OUT_MODE_S    0U
#define HRPWM_DBCTL_OUT_MODE_M    0x3U // Dead Band Output Mode Control
#define HRPWM_DBCTL_POLSEL_S      2U
#define HRPWM_DBCTL_POLSEL_M      0xCU // Polarity Select Control
#define HRPWM_DBCTL_IN_MODE_S     4U
#define HRPWM_DBCTL_IN_MODE_M     0x30U // Dead Band Input Select Mode Control
#define HRPWM_DBCTL_LOADREDMODE_S 6U
#define HRPWM_DBCTL_LOADREDMODE_M 0xC0U // Active DBRED Load Mode
#define HRPWM_DBCTL_LOADFEDMODE_S 8U
#define HRPWM_DBCTL_LOADFEDMODE_M 0x300U // Active DBFED Load Mode
#define HRPWM_DBCTL_SHDWDBREDMODE 0x400U // DBRED Block Operating Mode
#define HRPWM_DBCTL_SHDWDBFEDMODE 0x800U // DBFED Block Operating Mode
#define HRPWM_DBCTL_OUTSWAP_S     12U
#define HRPWM_DBCTL_OUTSWAP_M     0x3000U // Dead Band Output Swap Control
#define HRPWM_DBCTL_DEDB_MODE     0x4000U // Dead Band Dual-Edge B Mode Control
#define HRPWM_DBCTL_HALFCYCLE     0x8000U // Half Cycle Clocking Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBCTL2 register
//
//*************************************************************************************************
#define HRPWM_DBCTL2_LOADDBCTLMODE_S 0U
#define HRPWM_DBCTL2_LOADDBCTLMODE_M 0x3U // DBCTL Load from Shadow Mode Select
#define HRPWM_DBCTL2_SHDWDBCTLMODE   0x4U // DBCTL Load mode Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTL register
//
//*************************************************************************************************
#define HRPWM_AQCTL_LDAQAMODE_S 0U
#define HRPWM_AQCTL_LDAQAMODE_M 0x3U // Action Qualifier A Load Select
#define HRPWM_AQCTL_LDAQBMODE_S 2U
#define HRPWM_AQCTL_LDAQBMODE_M 0xCU  // Action Qualifier B Load Select
#define HRPWM_AQCTL_SHDWAQAMODE 0x10U // Action Qualifer A Operating Mode
#define HRPWM_AQCTL_SHDWAQBMODE 0x40U // Action Qualifier B Operating Mode
#define HRPWM_AQCTL_LDAQASYNC_S 8U
#define HRPWM_AQCTL_LDAQASYNC_M 0x300U // AQCTLA Register Load on SYNC
#define HRPWM_AQCTL_LDAQBSYNC_S 10U
#define HRPWM_AQCTL_LDAQBSYNC_M 0xC00U // AQCTLB Register Load on SYNC

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQTSRCSEL register
//
//*************************************************************************************************
#define HRPWM_AQTSRCSEL_T1SEL_S 0U
#define HRPWM_AQTSRCSEL_T1SEL_M 0xFU // T1 Event Source Select Bits
#define HRPWM_AQTSRCSEL_T2SEL_S 4U
#define HRPWM_AQTSRCSEL_T2SEL_M 0xF0U // T2 Event Source Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the PCCTL register
//
//*************************************************************************************************
#define HRPWM_PCCTL_CHPEN     0x1U // PWM chopping enable
#define HRPWM_PCCTL_OSHTWTH_S 1U
#define HRPWM_PCCTL_OSHTWTH_M 0x1EU // One-shot pulse width
#define HRPWM_PCCTL_CHPFREQ_S 5U
#define HRPWM_PCCTL_CHPFREQ_M 0xE0U // Chopping clock frequency
#define HRPWM_PCCTL_CHPDUTY_S 8U
#define HRPWM_PCCTL_CHPDUTY_M 0x700U // Chopping clock Duty cycle

//*************************************************************************************************
//
// The following are defines for the bit fields in the VCAPCTL register
//
//*************************************************************************************************
#define HRPWM_VCAPCTL_VCAPE          0x1U // Valley  Capture mode
#define HRPWM_VCAPCTL_VCAPSTART      0x2U // Valley  Capture Start
#define HRPWM_VCAPCTL_TRIGSEL_S      2U
#define HRPWM_VCAPCTL_TRIGSEL_M      0x1CU // Capture Trigger Select
#define HRPWM_VCAPCTL_VDELAYDIV_S    7U
#define HRPWM_VCAPCTL_VDELAYDIV_M    0x380U // Valley Delay Mode Divide Enable
#define HRPWM_VCAPCTL_EDGEFILTDLYSEL 0x400U // Valley Switching Mode Delay Select

//*************************************************************************************************
//
// The following are defines for the bit fields in the VCNTCFG register
//
//*************************************************************************************************
#define HRPWM_VCNTCFG_STARTEDGE_S  0U
#define HRPWM_VCNTCFG_STARTEDGE_M  0xFU  // Counter Start Edge Selection
#define HRPWM_VCNTCFG_STARTEDGESTS 0x80U // Start Edge Status Bit
#define HRPWM_VCNTCFG_STOPEDGE_S   8U
#define HRPWM_VCNTCFG_STOPEDGE_M   0xF00U  // Counter Start Edge Selection
#define HRPWM_VCNTCFG_STOPEDGESTS  0x8000U // Stop Edge Status Bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCNFG register
//
//*************************************************************************************************
#define HRPWM_HRCNFG_EDGMODE_S  0U
#define HRPWM_HRCNFG_EDGMODE_M  0x3U // ePWMxA Edge Mode Select Bits
#define HRPWM_HRCNFG_CTLMODE    0x4U // ePWMxA Control Mode Select Bits
#define HRPWM_HRCNFG_HRLOAD_S   3U
#define HRPWM_HRCNFG_HRLOAD_M   0x18U // ePWMxA Shadow Mode Select Bits
#define HRPWM_HRCNFG_SELOUTB    0x20U // EPWMB Output Selection Bit
#define HRPWM_HRCNFG_AUTOCONV   0x40U // Autoconversion Bit
#define HRPWM_HRCNFG_SWAPAB     0x80U // Swap EPWMA and EPWMB Outputs Bit
#define HRPWM_HRCNFG_EDGMODEB_S 8U
#define HRPWM_HRCNFG_EDGMODEB_M 0x300U // ePWMxB Edge Mode Select Bits
#define HRPWM_HRCNFG_CTLMODEB   0x400U // ePWMxB Control Mode Select Bits
#define HRPWM_HRCNFG_HRLOADB_S  11U
#define HRPWM_HRCNFG_HRLOADB_M  0x1800U // ePWMxB Shadow Mode Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRPWR register
//
//*************************************************************************************************
#define HRPWM_HRPWR_CALPWRON 0x8000U // Calibration Power On

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRMSTEP register
//
//*************************************************************************************************
#define HRPWM_HRMSTEP_HRMSTEP_S 0U
#define HRPWM_HRMSTEP_HRMSTEP_M 0xFFU // High Resolution Micro Step Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRCNFG2 register
//
//*************************************************************************************************
#define HRPWM_HRCNFG2_EDGMODEDB_S    0U
#define HRPWM_HRCNFG2_EDGMODEDB_M    0x3U // Dead-Band Edge-Mode Select Bits
#define HRPWM_HRCNFG2_CTLMODEDBRED_S 2U
#define HRPWM_HRCNFG2_CTLMODEDBRED_M 0xCU // DBRED Control Mode Select Bits
#define HRPWM_HRCNFG2_CTLMODEDBFED_S 4U
#define HRPWM_HRCNFG2_CTLMODEDBFED_M 0x30U // DBFED Control Mode Select Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the HRPCTL register
//
//*************************************************************************************************
#define HRPWM_HRPCTL_HRPE          0x1U // High Resolution Period Enable
#define HRPWM_HRPCTL_PWMSYNCSEL    0x2U // EPWMSYNCPER Source Select
#define HRPWM_HRPCTL_TBPHSHRLOADE  0x4U // TBPHSHR Load Enable
#define HRPWM_HRPCTL_PWMSYNCSELX_S 4U
#define HRPWM_HRPCTL_PWMSYNCSELX_M 0x70U // EPWMSYNCPER Extended Source Select Bit:

//*************************************************************************************************
//
// The following are defines for the bit fields in the TRREM register
//
//*************************************************************************************************
#define HRPWM_TRREM_TRREM_S 0U
#define HRPWM_TRREM_TRREM_M 0x7FFU // HRPWM Remainder Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the GLDCTL register
//
//*************************************************************************************************
#define HRPWM_GLDCTL_GLD       0x1U // Global Shadow to Active load event control
#define HRPWM_GLDCTL_GLDMODE_S 1U
#define HRPWM_GLDCTL_GLDMODE_M 0x1EU // Shadow to Active Global Load Pulse Selection
#define HRPWM_GLDCTL_OSHTMODE  0x20U // One Shot Load mode control bit
#define HRPWM_GLDCTL_GLDPRD_S  7U
#define HRPWM_GLDCTL_GLDPRD_M  0x380U // Global Load Strobe Period Select Register
#define HRPWM_GLDCTL_GLDCNT_S  10U
#define HRPWM_GLDCTL_GLDCNT_M  0x1C00U // Global Load Strobe Counter Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the GLDCFG register
//
//*************************************************************************************************
#define HRPWM_GLDCFG_TBPRD_TBPRDHR  0x1U   // Global load event configuration for TBPRD:TBPRDHR
#define HRPWM_GLDCFG_CMPA_CMPAHR    0x2U   // Global load event configuration for CMPA:CMPAHR
#define HRPWM_GLDCFG_CMPB_CMPBHR    0x4U   // Global load event configuration for CMPB:CMPBHR
#define HRPWM_GLDCFG_CMPC           0x8U   // Global load event configuration for CMPC
#define HRPWM_GLDCFG_CMPD           0x10U  // Global load event configuration for CMPD
#define HRPWM_GLDCFG_DBRED_DBREDHR  0x20U  // Global load event configuration for DBRED:DBREDHR
#define HRPWM_GLDCFG_DBFED_DBFEDHR  0x40U  // Global load event configuration for DBFED:DBFEDHR
#define HRPWM_GLDCFG_DBCTL          0x80U  // Global load event configuration for DBCTL
#define HRPWM_GLDCFG_AQCTLA_AQCTLA2 0x100U // Global load event configuration for AQCTLA/A2
#define HRPWM_GLDCFG_AQCTLB_AQCTLB2 0x200U // Global load event configuration for AQCTLB/B2
#define HRPWM_GLDCFG_AQCSFRC        0x400U // Global load event configuration for AQCSFRC

//*************************************************************************************************
//
// The following are defines for the bit fields in the EPWMXLINK register
//
//*************************************************************************************************
#define HRPWM_EPWMXLINK_TBPRDLINK_S   0U
#define HRPWM_EPWMXLINK_TBPRDLINK_M   0xFU // TBPRD:TBPRDHR  Link
#define HRPWM_EPWMXLINK_CMPALINK_S    4U
#define HRPWM_EPWMXLINK_CMPALINK_M    0xF0U // CMPA:CMPAHR Link
#define HRPWM_EPWMXLINK_CMPBLINK_S    8U
#define HRPWM_EPWMXLINK_CMPBLINK_M    0xF00U // CMPB:CMPBHR Link
#define HRPWM_EPWMXLINK_CMPCLINK_S    12U
#define HRPWM_EPWMXLINK_CMPCLINK_M    0xF000U // CMPC Link
#define HRPWM_EPWMXLINK_CMPDLINK_S    16U
#define HRPWM_EPWMXLINK_CMPDLINK_M    0xF0000U // CMPD Link
#define HRPWM_EPWMXLINK_GLDCTL2LINK_S 28U
#define HRPWM_EPWMXLINK_GLDCTL2LINK_M 0xF0000000U // GLDCTL2 Link

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTLA register
//
//*************************************************************************************************
#define HRPWM_AQCTLA_ZRO_S 0U
#define HRPWM_AQCTLA_ZRO_M 0x3U // Action Counter = Zero
#define HRPWM_AQCTLA_PRD_S 2U
#define HRPWM_AQCTLA_PRD_M 0xCU // Action Counter = Period
#define HRPWM_AQCTLA_CAU_S 4U
#define HRPWM_AQCTLA_CAU_M 0x30U // Action Counter = Compare A Up
#define HRPWM_AQCTLA_CAD_S 6U
#define HRPWM_AQCTLA_CAD_M 0xC0U // Action Counter = Compare A Down
#define HRPWM_AQCTLA_CBU_S 8U
#define HRPWM_AQCTLA_CBU_M 0x300U // Action Counter = Compare B Up
#define HRPWM_AQCTLA_CBD_S 10U
#define HRPWM_AQCTLA_CBD_M 0xC00U // Action Counter = Compare B Down

