QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_hrpwm.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTLA2 register
//
//*************************************************************************************************
#define HRPWM_AQCTLA2_T1U_S 0U
#define HRPWM_AQCTLA2_T1U_M 0x3U // Action when event occurs on T1 in UP-Count
#define HRPWM_AQCTLA2_T1D_S 2U
#define HRPWM_AQCTLA2_T1D_M 0xCU // Action when event occurs on T1 in DOWN-Count
#define HRPWM_AQCTLA2_T2U_S 4U
#define HRPWM_AQCTLA2_T2U_M 0x30U // Action when event occurs on T2 in UP-Count
#define HRPWM_AQCTLA2_T2D_S 6U
#define HRPWM_AQCTLA2_T2D_M 0xC0U // Action when event occurs on T2 in DOWN-Count

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTLB register
//
//*************************************************************************************************
#define HRPWM_AQCTLB_ZRO_S 0U
#define HRPWM_AQCTLB_ZRO_M 0x3U // Action Counter = Zero
#define HRPWM_AQCTLB_PRD_S 2U
#define HRPWM_AQCTLB_PRD_M 0xCU // Action Counter = Period
#define HRPWM_AQCTLB_CAU_S 4U
#define HRPWM_AQCTLB_CAU_M 0x30U // Action Counter = Compare A Up
#define HRPWM_AQCTLB_CAD_S 6U
#define HRPWM_AQCTLB_CAD_M 0xC0U // Action Counter = Compare A Down
#define HRPWM_AQCTLB_CBU_S 8U
#define HRPWM_AQCTLB_CBU_M 0x300U // Action Counter = Compare B Up
#define HRPWM_AQCTLB_CBD_S 10U
#define HRPWM_AQCTLB_CBD_M 0xC00U // Action Counter = Compare B Down

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCTLB2 register
//
//*************************************************************************************************
#define HRPWM_AQCTLB2_T1U_S 0U
#define HRPWM_AQCTLB2_T1U_M 0x3U // Action when event occurs on T1 in UP-Count
#define HRPWM_AQCTLB2_T1D_S 2U
#define HRPWM_AQCTLB2_T1D_M 0xCU // Action when event occurs on T1 in DOWN-Count
#define HRPWM_AQCTLB2_T2U_S 4U
#define HRPWM_AQCTLB2_T2U_M 0x30U // Action when event occurs on T2 in UP-Count
#define HRPWM_AQCTLB2_T2D_S 6U
#define HRPWM_AQCTLB2_T2D_M 0xC0U // Action when event occurs on T2 in DOWN-Count

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQSFRC register
//
//*************************************************************************************************
#define HRPWM_AQSFRC_ACTSFA_S 0U
#define HRPWM_AQSFRC_ACTSFA_M 0x3U // Action when One-time SW Force A Invoked
#define HRPWM_AQSFRC_OTSFA    0x4U // One-time SW Force A Output
#define HRPWM_AQSFRC_ACTSFB_S 3U
#define HRPWM_AQSFRC_ACTSFB_M 0x18U // Action when One-time SW Force B Invoked
#define HRPWM_AQSFRC_OTSFB    0x20U // One-time SW Force A Output
#define HRPWM_AQSFRC_RLDCSF_S 6U
#define HRPWM_AQSFRC_RLDCSF_M 0xC0U // Reload from Shadow Options

//*************************************************************************************************
//
// The following are defines for the bit fields in the AQCSFRC register
//
//*************************************************************************************************
#define HRPWM_AQCSFRC_CSFA_S 0U
#define HRPWM_AQCSFRC_CSFA_M 0x3U // Continuous Software Force on output A
#define HRPWM_AQCSFRC_CSFB_S 2U
#define HRPWM_AQCSFRC_CSFB_M 0xCU // Continuous Software Force on output B

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBREDHR register
//
//*************************************************************************************************
#define HRPWM_DBREDHR_DBREDHR_S 9U
#define HRPWM_DBREDHR_DBREDHR_M 0xFE00U // DBREDHR High Resolution Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBRED register
//
//*************************************************************************************************
#define HRPWM_DBRED_DBRED_S 0U
#define HRPWM_DBRED_DBRED_M 0x3FFFU // Rising edge delay value

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBFEDHR register
//
//*************************************************************************************************
#define HRPWM_DBFEDHR_DBFEDHR_S 9U
#define HRPWM_DBFEDHR_DBFEDHR_M 0xFE00U // DBFEDHR High Resolution Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the DBFED register
//
//*************************************************************************************************
#define HRPWM_DBFED_DBFED_S 0U
#define HRPWM_DBFED_DBFED_M 0x3FFFU // Falling edge delay value

//*************************************************************************************************
//
// The following are defines for the bit fields in the TBPHS register
//
//*************************************************************************************************
#define HRPWM_TBPHS_TBPHSHR_S 0U
#define HRPWM_TBPHS_TBPHSHR_M 0xFFFFU // Extension Register for HRPWM Phase (8-bits)
#define HRPWM_TBPHS_TBPHS_S   16U
#define HRPWM_TBPHS_TBPHS_M   0xFFFF0000U // Phase Offset Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPA register
//
//*************************************************************************************************
#define HRPWM_CMPA_CMPAHR_S 0U
#define HRPWM_CMPA_CMPAHR_M 0xFFFFU // Compare A HRPWM Extension Register
#define HRPWM_CMPA_CMPA_S   16U
#define HRPWM_CMPA_CMPA_M   0xFFFF0000U // Compare A Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the CMPB register
//
//*************************************************************************************************
#define HRPWM_CMPB_CMPBHR_S 0U
#define HRPWM_CMPB_CMPBHR_M 0xFFFFU // Compare B High Resolution Bits
#define HRPWM_CMPB_CMPB_S   16U
#define HRPWM_CMPB_CMPB_M   0xFFFF0000U // Compare B Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the GLDCTL2 register
//
//*************************************************************************************************
#define HRPWM_GLDCTL2_OSHTLD 0x1U // Enable reload event in one shot mode
#define HRPWM_GLDCTL2_GFRCLD 0x2U // Force reload event in one shot mode

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZSEL register
//
//*************************************************************************************************
#define HRPWM_TZSEL_CBC1    0x1U    // TZ1 CBC select
#define HRPWM_TZSEL_CBC2    0x2U    // TZ2 CBC select
#define HRPWM_TZSEL_CBC3    0x4U    // TZ3 CBC select
#define HRPWM_TZSEL_CBC4    0x8U    // TZ4 CBC select
#define HRPWM_TZSEL_CBC5    0x10U   // TZ5 CBC select
#define HRPWM_TZSEL_CBC6    0x20U   // TZ6 CBC select
#define HRPWM_TZSEL_DCAEVT2 0x40U   // DCAEVT2 CBC select
#define HRPWM_TZSEL_DCBEVT2 0x80U   // DCBEVT2 CBC select
#define HRPWM_TZSEL_OSHT1   0x100U  // One-shot TZ1 select
#define HRPWM_TZSEL_OSHT2   0x200U  // One-shot TZ2 select
#define HRPWM_TZSEL_OSHT3   0x400U  // One-shot TZ3 select
#define HRPWM_TZSEL_OSHT4   0x800U  // One-shot TZ4 select
#define HRPWM_TZSEL_OSHT5   0x1000U // One-shot TZ5 select
#define HRPWM_TZSEL_OSHT6   0x2000U // One-shot TZ6 select
#define HRPWM_TZSEL_DCAEVT1 0x4000U // One-shot DCAEVT1 select
#define HRPWM_TZSEL_DCBEVT1 0x8000U // One-shot DCBEVT1 select

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZDCSEL register
//
//*************************************************************************************************
#define HRPWM_TZDCSEL_DCAEVT1_S 0U
#define HRPWM_TZDCSEL_DCAEVT1_M 0x7U // Digital Compare Output A Event 1
#define HRPWM_TZDCSEL_DCAEVT2_S 3U
#define HRPWM_TZDCSEL_DCAEVT2_M 0x38U // Digital Compare Output A Event 2
#define HRPWM_TZDCSEL_DCBEVT1_S 6U
#define HRPWM_TZDCSEL_DCBEVT1_M 0x1C0U // Digital Compare Output B Event 1
#define HRPWM_TZDCSEL_DCBEVT2_S 9U
#define HRPWM_TZDCSEL_DCBEVT2_M 0xE00U // Digital Compare Output B Event 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCTL register
//
//*************************************************************************************************
#define HRPWM_TZCTL_TZA_S     0U
#define HRPWM_TZCTL_TZA_M     0x3U // TZ1 to TZ6 Trip Action On EPWMxA
#define HRPWM_TZCTL_TZB_S     2U
#define HRPWM_TZCTL_TZB_M     0xCU // TZ1 to TZ6 Trip Action On EPWMxB
#define HRPWM_TZCTL_DCAEVT1_S 4U
#define HRPWM_TZCTL_DCAEVT1_M 0x30U // EPWMxA action on DCAEVT1
#define HRPWM_TZCTL_DCAEVT2_S 6U
#define HRPWM_TZCTL_DCAEVT2_M 0xC0U // EPWMxA action on DCAEVT2
#define HRPWM_TZCTL_DCBEVT1_S 8U
#define HRPWM_TZCTL_DCBEVT1_M 0x300U // EPWMxB action on DCBEVT1
#define HRPWM_TZCTL_DCBEVT2_S 10U
#define HRPWM_TZCTL_DCBEVT2_M 0xC00U // EPWMxB action on DCBEVT2

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCTL2 register
//
//*************************************************************************************************
#define HRPWM_TZCTL2_TZAU_S 0U
#define HRPWM_TZCTL2_TZAU_M 0x7U // Trip Action On EPWMxA while Count direction is UP
#define HRPWM_TZCTL2_TZAD_S 3U
#define HRPWM_TZCTL2_TZAD_M 0x38U // Trip Action On EPWMxA while Count direction is DOWN
#define HRPWM_TZCTL2_TZBU_S 6U
#define HRPWM_TZCTL2_TZBU_M 0x1C0U // Trip Action On EPWMxB while Count direction is UP
#define HRPWM_TZCTL2_TZBD_S 9U
#define HRPWM_TZCTL2_TZBD_M 0xE00U  // Trip Action On EPWMxB while Count direction is DOWN
#define HRPWM_TZCTL2_ETZE   0x8000U // TZCTL2 Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCTLDCA register
//
//*************************************************************************************************
#define HRPWM_TZCTLDCA_DCAEVT1U_S 0U
#define HRPWM_TZCTLDCA_DCAEVT1U_M \
    0x7U // DCAEVT1 Action On EPWMxA while Count direction is
         // UP
#define HRPWM_TZCTLDCA_DCAEVT1D_S 3U
#define HRPWM_TZCTLDCA_DCAEVT1D_M \
    0x38U // DCAEVT1 Action On EPWMxA while Count direction is
          // DOWN
#define HRPWM_TZCTLDCA_DCAEVT2U_S 6U
#define HRPWM_TZCTLDCA_DCAEVT2U_M \
    0x1C0U // DCAEVT2 Action On EPWMxA while Count direction is
           // UP
#define HRPWM_TZCTLDCA_DCAEVT2D_S 9U
#define HRPWM_TZCTLDCA_DCAEVT2D_M \
    0xE00U // DCAEVT2 Action On EPWMxA while Count direction is
           // DOWN

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCTLDCB register
//
//*************************************************************************************************
#define HRPWM_TZCTLDCB_DCBEVT1U_S 0U
#define HRPWM_TZCTLDCB_DCBEVT1U_M \
    0x7U // DCBEVT1 Action On EPWMxA while Count direction is
         // UP
#define HRPWM_TZCTLDCB_DCBEVT1D_S 3U
#define HRPWM_TZCTLDCB_DCBEVT1D_M \
    0x38U // DCBEVT1 Action On EPWMxA while Count direction is
          // DOWN
#define HRPWM_TZCTLDCB_DCBEVT2U_S 6U
#define HRPWM_TZCTLDCB_DCBEVT2U_M \
    0x1C0U // DCBEVT2 Action On EPWMxA while Count direction is
           // UP
#define HRPWM_TZCTLDCB_DCBEVT2D_S 9U
#define HRPWM_TZCTLDCB_DCBEVT2D_M \
    0xE00U // DCBEVT2 Action On EPWMxA while Count direction is
           // DOWN

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZEINT register
//
//*************************************************************************************************
#define HRPWM_TZEINT_CBC     0x2U  // Trip Zones Cycle By Cycle Int Enable
#define HRPWM_TZEINT_OST     0x4U  // Trip Zones One Shot Int Enable
#define HRPWM_TZEINT_DCAEVT1 0x8U  // Digital Compare A Event 1 Int Enable
#define HRPWM_TZEINT_DCAEVT2 0x10U // Digital Compare A Event 2 Int Enable
#define HRPWM_TZEINT_DCBEVT1 0x20U // Digital Compare B Event 1 Int Enable
#define HRPWM_TZEINT_DCBEVT2 0x40U // Digital Compare B Event 2 Int Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZFLG register
//
//*************************************************************************************************
#define HRPWM_TZFLG_INT     0x1U  // Global Int Status Flag
#define HRPWM_TZFLG_CBC     0x2U  // Trip Zones Cycle By Cycle Flag
#define HRPWM_TZFLG_OST     0x4U  // Trip Zones One Shot Flag
#define HRPWM_TZFLG_DCAEVT1 0x8U  // Digital Compare A Event 1 Flag
#define HRPWM_TZFLG_DCAEVT2 0x10U // Digital Compare A Event 2 Flag
#define HRPWM_TZFLG_DCBEVT1 0x20U // Digital Compare B Event 1 Flag
#define HRPWM_TZFLG_DCBEVT2 0x40U // Digital Compare B Event 2 Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCBCFLG register
//
//*************************************************************************************************
#define HRPWM_TZCBCFLG_CBC1 0x1U  // Latched Status Flag for CBC1 Trip Latch
#define HRPWM_TZCBCFLG_CBC2 0x2U  // Latched Status Flag for CBC2 Trip Latch
#define HRPWM_TZCBCFLG_CBC3 0x4U  // Latched Status Flag for CBC3 Trip Latch
#define HRPWM_TZCBCFLG_CBC4 0x8U  // Latched Status Flag for CBC4 Trip Latch
#define HRPWM_TZCBCFLG_CBC5 0x10U // Latched Status Flag for CBC5 Trip Latch
#define HRPWM_TZCBCFLG_CBC6 0x20U // Latched Status Flag for CBC6 Trip Latch
#define HRPWM_TZCBCFLG_DCAEVT2 \
    0x40U // Latched Status Flag for Digital Compare Output A Event
          // 2
#define HRPWM_TZCBCFLG_DCBEVT2 \
    0x80U // Latched Status Flag for Digital Compare Output B Event
          // 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZOSTFLG register
//
//*************************************************************************************************
#define HRPWM_TZOSTFLG_OST1 0x1U  // Latched Status Flag for OST1 Trip Latch
#define HRPWM_TZOSTFLG_OST2 0x2U  // Latched Status Flag for OST2 Trip Latch
#define HRPWM_TZOSTFLG_OST3 0x4U  // Latched Status Flag for OST3 Trip Latch
#define HRPWM_TZOSTFLG_OST4 0x8U  // Latched Status Flag for OST4 Trip Latch
#define HRPWM_TZOSTFLG_OST5 0x10U // Latched Status Flag for OST5 Trip Latch
#define HRPWM_TZOSTFLG_OST6 0x20U // Latched Status Flag for OST6 Trip Latch
#define HRPWM_TZOSTFLG_DCAEVT1 \
    0x40U // Latched Status Flag for Digital Compare Output A Event
          // 1
#define HRPWM_TZOSTFLG_DCBEVT1 \
    0x80U // Latched Status Flag for Digital Compare Output B Event
          // 1

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCLR register
//
//*************************************************************************************************
#define HRPWM_TZCLR_INT        0x1U  // Global Interrupt Clear Flag
#define HRPWM_TZCLR_CBC        0x2U  // Cycle-By-Cycle Flag Clear
#define HRPWM_TZCLR_OST        0x4U  // One-Shot Flag Clear
#define HRPWM_TZCLR_DCAEVT1    0x8U  // DCAVET1 Flag Clear
#define HRPWM_TZCLR_DCAEVT2    0x10U // DCAEVT2 Flag Clear
#define HRPWM_TZCLR_DCBEVT1    0x20U // DCBEVT1 Flag Clear
#define HRPWM_TZCLR_DCBEVT2    0x40U // DCBEVT2 Flag Clear
#define HRPWM_TZCLR_CBCPULSE_S 14U
#define HRPWM_TZCLR_CBCPULSE_M 0xC000U // Clear Pulse for CBC Trip Latch

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZCBCCLR register
//
//*************************************************************************************************
#define HRPWM_TZCBCCLR_CBC1    0x1U  // Clear Flag for Cycle-By-Cycle (CBC1) Trip Latch
#define HRPWM_TZCBCCLR_CBC2    0x2U  // Clear Flag for Cycle-By-Cycle (CBC2) Trip Latch
#define HRPWM_TZCBCCLR_CBC3    0x4U  // Clear Flag for Cycle-By-Cycle (CBC3) Trip Latch
#define HRPWM_TZCBCCLR_CBC4    0x8U  // Clear Flag for Cycle-By-Cycle (CBC4) Trip Latch
#define HRPWM_TZCBCCLR_CBC5    0x10U // Clear Flag for Cycle-By-Cycle (CBC5) Trip Latch
#define HRPWM_TZCBCCLR_CBC6    0x20U // Clear Flag for Cycle-By-Cycle (CBC6) Trip Latch
#define HRPWM_TZCBCCLR_DCAEVT2 0x40U // Clear Flag forDCAEVT2 selected for CBC
#define HRPWM_TZCBCCLR_DCBEVT2 0x80U // Clear Flag for DCBEVT2 selected for CBC

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZOSTCLR register
//
//*************************************************************************************************
#define HRPWM_TZOSTCLR_OST1    0x1U  // Clear Flag for Oneshot (OST1) Trip Latch
#define HRPWM_TZOSTCLR_OST2    0x2U  // Clear Flag for Oneshot (OST2) Trip Latch
#define HRPWM_TZOSTCLR_OST3    0x4U  // Clear Flag for Oneshot (OST3) Trip Latch
#define HRPWM_TZOSTCLR_OST4    0x8U  // Clear Flag for Oneshot (OST4) Trip Latch
#define HRPWM_TZOSTCLR_OST5    0x10U // Clear Flag for Oneshot (OST5) Trip Latch
#define HRPWM_TZOSTCLR_OST6    0x20U // Clear Flag for Oneshot (OST6) Trip Latch
#define HRPWM_TZOSTCLR_DCAEVT1 0x40U // Clear Flag for DCAEVT1 selected for OST
#define HRPWM_TZOSTCLR_DCBEVT1 0x80U // Clear Flag for DCBEVT1 selected for OST

//*************************************************************************************************
//
// The following are defines for the bit fields in the TZFRC register
//
//*************************************************************************************************
#define HRPWM_TZFRC_CBC     0x2U  // Force Trip Zones Cycle By Cycle Event
#define HRPWM_TZFRC_OST     0x4U  // Force Trip Zones One Shot Event
#define HRPWM_TZFRC_DCAEVT1 0x8U  // Force Digital Compare A Event 1
#define HRPWM_TZFRC_DCAEVT2 0x10U // Force Digital Compare A Event 2
#define HRPWM_TZFRC_DCBEVT1 0x20U // Force Digital Compare B Event 1
#define HRPWM_TZFRC_DCBEVT2 0x40U // Force Digital Compare B Event 2

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETSEL register
//
//*************************************************************************************************
#define HRPWM_ETSEL_INTSEL_S   0U
#define HRPWM_ETSEL_INTSEL_M   0x7U  // EPWMxINTn Select
#define HRPWM_ETSEL_INTEN      0x8U  // EPWMxINTn Enable
#define HRPWM_ETSEL_SOCASELCMP 0x10U // EPWMxSOCA Compare Select
#define HRPWM_ETSEL_SOCBSELCMP 0x20U // EPWMxSOCB Compare Select
#define HRPWM_ETSEL_INTSELCMP  0x40U // EPWMxINT Compare Select
#define HRPWM_ETSEL_SOCASEL_S  8U
#define HRPWM_ETSEL_SOCASEL_M  0x700U // Start of Conversion A Select
#define HRPWM_ETSEL_SOCAEN     0x800U // Start of Conversion A Enable
#define HRPWM_ETSEL_SOCBSEL_S  12U
#define HRPWM_ETSEL_SOCBSEL_M  0x7000U // Start of Conversion B Select
#define HRPWM_ETSEL_SOCBEN     0x8000U // Start of Conversion B Enable

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETPS register
//
//*************************************************************************************************
#define HRPWM_ETPS_INTPRD_S  0U
#define HRPWM_ETPS_INTPRD_M  0x3U // EPWMxINTn Period Select
#define HRPWM_ETPS_INTCNT_S  2U
#define HRPWM_ETPS_INTCNT_M  0xCU  // EPWMxINTn Counter Register
#define HRPWM_ETPS_INTPSSEL  0x10U // EPWMxINTn Pre-Scale Selection Bits
#define HRPWM_ETPS_SOCPSSEL  0x20U // EPWMxSOC A/B  Pre-Scale Selection Bits
#define HRPWM_ETPS_SOCAPRD_S 8U
#define HRPWM_ETPS_SOCAPRD_M 0x300U // EPWMxSOCA Period Select
#define HRPWM_ETPS_SOCACNT_S 10U
#define HRPWM_ETPS_SOCACNT_M 0xC00U // EPWMxSOCA Counter Register
#define HRPWM_ETPS_SOCBPRD_S 12U
#define HRPWM_ETPS_SOCBPRD_M 0x3000U // EPWMxSOCB Period Select
#define HRPWM_ETPS_SOCBCNT_S 14U
#define HRPWM_ETPS_SOCBCNT_M 0xC000U // EPWMxSOCB Counter

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETFLG register
//
//*************************************************************************************************
#define HRPWM_ETFLG_INT  0x1U // EPWMxINTn Flag
#define HRPWM_ETFLG_SOCA 0x4U // EPWMxSOCA Flag
#define HRPWM_ETFLG_SOCB 0x8U // EPWMxSOCB Flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETCLR register
//
//*************************************************************************************************
#define HRPWM_ETCLR_INT  0x1U // EPWMxINTn Clear
#define HRPWM_ETCLR_SOCA 0x4U // EPWMxSOCA Clear
#define HRPWM_ETCLR_SOCB 0x8U // EPWMxSOCB Clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETFRC register
//
//*************************************************************************************************
#define HRPWM_ETFRC_INT  0x1U // EPWMxINTn Force
#define HRPWM_ETFRC_SOCA 0x4U // EPWMxSOCA Force
#define HRPWM_ETFRC_SOCB 0x8U // EPWMxSOCB Force

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETINTPS register
//
//*************************************************************************************************
#define HRPWM_ETINTPS_INTPRD2_S 0U
#define HRPWM_ETINTPS_INTPRD2_M 0xFU // EPWMxINTn Period Select
#define HRPWM_ETINTPS_INTCNT2_S 4U
#define HRPWM_ETINTPS_INTCNT2_M 0xF0U // EPWMxINTn Counter Register

//*************************************************************************************************
//
// The following are defines for the bit fields in the ETSOCPS register
//
//*************************************************************************************************
#define HRPWM_ETSOCPS_SOCAPRD2_S 0U
#define HRPWM_ETSOCPS_SOCAPRD2_M 0xFU // EPWMxSOCA Period Select
#define HRPWM_ETSOCPS_SOCACNT2_S 4U
#define HRPWM_ETSOCPS_SOCACNT2_M 0xF0U // EPWMxSOCA Counter Register
#define HRPWM_ETSOCPS_SOCBPRD2_S 8U
#define HRPWM_ETSOCPS_SOCBPRD2_M 0xF00U // EPWMxSOCB Period Select
#define HRPWM_ETSOCPS_SOCBCNT2_S 12U
#define HRPWM_ETSOCPS_SOCBCNT2_M 0xF000U // EPWMxSOCB Counter Register

